namespace MyBlazorApp.Models
{
    // Το EF Core αποθηκεύει το enum ως int στη βάση δεδομένων. Το enum μετατρέπει το status της παραγγελίας από απλό κείμενο σε ελεγχόμενο επιχειρησιακό κανόνα.
    public enum OrderStatus     // Εδώ δημιουργείται ένα enum(OrderStatus), που είναι ένας ειδικός τύπος δεδομένων επιτρέποντας μόνο προκαθορισμένες τιμές. Στην προκειμένη περίπτωση το OrderStatus, περιγράφει όλες τις επιτρεπτές καταστάσεις μίας παραγγελίας, καθώς κάθε τιμή του enum αντιστοιχέι εσωτερικά σε έναν αριθμό (int).
    {
        Pending = 0,
        Completed = 1,
        Cancelled = 2
    }
}