using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace MyBlazorApp.Models
{
    public class Order    // Δημιουργία κλάσης(Order), που αντιπροσωπεύει μία παραγγελία ενός πελάτη. Η κλάση αυτή είναι (public), ώστε να μπορεί να χρησιμοποιηθεί από services, controllers, Razor components και EF Core.
    {
        public int Id { get; set; }     // Το (Id) αντιπροσωπεύει το order id της κάθε παραγγελίας και αποτελεί το πρωτεύον κλειδί για την βάση δεδομένων, καθώς κάθε νέα παραγγελία θα έχει μοναδικό (id στην βάση δεδομένων).

        // Εδώ αποθηκεύεται το username του πελάτη που έκανε την παραγγελία, καθώς χρησιμοποιείται για απλό σύνδεσμο παραγγελίας με χρήστη χωρίς να απαιτείται navigation property σε Customer ενώ ταυτόχρονα αρχικοποιείται με ένα κενό αλφαριθμητικό, εξασφαλίζοντας ότι δεν θα είναι ποτέ null.
        public string CustomerUsername { get; set; } = string.Empty;

        // Εδώ αποθηκεύεται η ημερομηνία για το πότε έγινε η παραγγελία καθώς αρχικοποιείται με το DateTime.UtcNow, δηλαδή την τρέχουσα ώρα σε UTC. Στην ουσία καταγράφεται η ημερομηνία/ώρα δημιουργίας της παραγγελίας, καθώς τίθεται θέτει η τρέχουσα ώρα UTC κατά τη δημιουργία του αντικειμένου, αποφεύγοντας προβλήματα ζωνών ώρας.
        public DateTime OrderDate { get; set; } = DateTime.UtcNow;  

        // Εδώ αποθηκεύεται το συνολικό χρηματικό ποσό της παραγγελίας, καθώς ο τύπος επιστρεφόμενης τιμής της ιδιότητας είναι decimal και είναι κατάλληλος για νομισματικούς υπολογισμούς επειδή έχει υψηλή ακρίβεια και αποφεύγει σφάλματα στρογγυλοποίησης που εμφανίζονται με τύπο δεδομένου double. Κι έτσι το συνολικό ποσό θα υπολογίζεται αθροίζοντας (Price * Quantity) για κάθε προϊόν.
        public decimal TotalAmount { get; set; }

        // Εδώ αποθηκεύεται ο τρόπος πληρωμής που επέλεξε ο πελάτης (Credit Card, PayPal, Cash on Delivery), καθώς αρχικοποιείται με string.Empty για να αποφευχθούν null.
        public string PaymentMethod { get; set; } = string.Empty;

        // Εδώ αποθηκεύεται η κατάσταση παραγγελίας, καθώς αρχικοποιείται με την τιμή (Completed)
        public OrderStatus Status { get; set; } = OrderStatus.Completed;

        // Σε αυτή την ιδιότητα αποθηκεύονται τα προιόντα παραγγελίας ως λίστα αντικειμένων (OrderItem), καθώς κάθε item παραγγελίας θα περιέχει: ProductId, ProductName, Price, Quantity. Η χρήση του List<T>, επιτρέπει εύκολη προσθήκη/αφαίρεση και χρήση LINQ για υπολογισμούς. Η λίστα προιόντων παραγγελίας αρχικοποιείται με new(), ώστε η λίστα να μην είναι ποτέ null, δημιουργώντας συσχέτιση (1:N => 1 παραγγελία έχει πολλά OrderItems).
        public List<OrderItem> Items { get; set; } = new();
    }
}